Extensions/нп_ДатыЗапретаИзменения/configurator/Documents/нп_ЗаявкаНаОткрытиеПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>нп_ЗаявкаНаОткрытиеПериода</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделДатыЗапрета</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
						<v8:Type>cfg:CatalogRef.ГруппыПользователей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОткрытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособУказания</Name>
					<Comment>Как в типовой форме дат запрета</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.нп_СпособыУказанияОткрытияПериода</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Объекты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОбъектДатыЗапрета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
								<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
								<v8:Type>cfg:CatalogRef.СценарииТоварногоПланирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазделДатыЗапрета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.РазделыДатЗапретаИзменения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Enums/нп_СпособыУказанияОткрытияПериода.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>нп_СпособыУказанияОткрытияПериода</Name>
			<Comment>Как в типовой форме дат запрета: по разделам или по разделам и объектам</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоРазделам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоРазделамИОбъектам</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Extensions/нп_ДатыЗапретаИзменения/configurator/Documents/нп_ЗаявкаНаОткрытиеПериода/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособУказания) Тогда
		СпособУказания = Перечисления.нп_СпособыУказанияОткрытияПериода.ПоРазделамИОбъектам;
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = Пользователи.АвторизованныйПользователь();
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(СпособУказания) Тогда
		СпособУказания = Перечисления.нп_СпособыУказанияОткрытияПериода.ПоРазделамИОбъектам;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		нп_ДатыЗапретаИзменения.ПроверитьЗаявкуПередЗаписью(ЭтотОбъект);
		Возврат;
	КонецЕсли;
	
	Если ПометкаУдаления И нп_ДатыЗапретаИзменения.ЕстьДействующееСостояниеПоЗаявке(Ссылка) Тогда
		ВызватьИсключение НСтр("ru = 'Пометка на удаление запрещена, пока открытый период действует. Сначала выполните «Закрыть период досрочно».'");
	КонецЕсли;
	
	Если нп_ДатыЗапретаИзменения.ДокументСогласован(Ссылка)
		Или нп_ДатыЗапретаИзменения.ЕстьДействующееСостояниеПоЗаявке(Ссылка) Тогда
		ВызватьИсключение НСтр("ru = 'Согласованную заявку изменять нельзя. Чтобы изменить параметры, закройте период досрочно и создайте новую заявку.'");
	КонецЕсли;
	
	нп_ДатыЗапретаИзменения.ПроверитьЗаявкуПередЗаписью(ЭтотОбъект);
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если нп_ДатыЗапретаИзменения.ЕстьДействующееСостояниеПоЗаявке(Ссылка) Тогда
		ВызватьИсключение НСтр("ru = 'Удаление запрещено, пока открытый период действует. Сначала выполните «Закрыть период досрочно».'");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
